<h1>DataFrames</h1>

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [45]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [46]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [47]:
df['W']

A    1.606780
B    0.041460
C   -0.804652
D   -1.080471
E    0.975720
Name: W, dtype: float64

In [48]:
df.W

A    1.606780
B    0.041460
C   -0.804652
D   -1.080471
E    0.975720
Name: W, dtype: float64

In [49]:
df[['W','Z']]

          W         Z
A  1.606780 -1.329660
B  0.041460  0.110477
C -0.804652  0.358941
D -1.080471  0.833029
E  0.975720 -0.708954

In [50]:
df['new'] = df['W'] + df['Y']

In [51]:
df

          W         X         Y         Z       new
A  1.606780 -1.115710 -1.385379 -1.329660  0.221401
B  0.041460 -0.411055 -0.771329  0.110477 -0.729869
C -0.804652  0.253548  0.649148  0.358941 -0.155504
D -1.080471  0.902398  0.161781  0.833029 -0.918690
E  0.975720 -0.388239  0.783316 -0.708954  1.759036

In [52]:
df.drop('new', axis=1, inplace=True)

In [53]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [54]:
df.drop('E', axis=0)

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029

In [55]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [57]:
df.shape

(5, 4)

In [58]:
df[['Z', 'X']]

          Z         X
A -1.329660 -1.115710
B  0.110477 -0.411055
C  0.358941  0.253548
D  0.833029  0.902398
E -0.708954 -0.388239

In [59]:
# Rows

In [60]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [62]:
df.loc['C']

W   -0.804652
X    0.253548
Y    0.649148
Z    0.358941
Name: C, dtype: float64

In [63]:
df.iloc[2]

W   -0.804652
X    0.253548
Y    0.649148
Z    0.358941
Name: C, dtype: float64

In [64]:
df.loc['B', 'Y']

-0.7713286047373022

In [65]:
df.loc[['A', 'B'], ['W', 'Y']]

         W         Y
A  1.60678 -1.385379
B  0.04146 -0.771329

In [66]:
df > 0

       W      X      Y      Z
A   True  False  False  False
B   True  False  False   True
C  False   True   True   True
D  False   True   True   True
E   True  False   True  False

In [67]:
booldf = df > 0

In [68]:
booldf

       W      X      Y      Z
A   True  False  False  False
B   True  False  False   True
C  False   True   True   True
D  False   True   True   True
E   True  False   True  False

In [69]:
df[booldf]

         W         X         Y         Z
A  1.60678       NaN       NaN       NaN
B  0.04146       NaN       NaN  0.110477
C      NaN  0.253548  0.649148  0.358941
D      NaN  0.902398  0.161781  0.833029
E  0.97572       NaN  0.783316       NaN

In [70]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [71]:
df[df>0]

         W         X         Y         Z
A  1.60678       NaN       NaN       NaN
B  0.04146       NaN       NaN  0.110477
C      NaN  0.253548  0.649148  0.358941
D      NaN  0.902398  0.161781  0.833029
E  0.97572       NaN  0.783316       NaN

In [72]:
df['W']>0

A     True
B     True
C    False
D    False
E     True
Name: W, dtype: bool

In [73]:
df[df['W']>0]

         W         X         Y         Z
A  1.60678 -1.115710 -1.385379 -1.329660
B  0.04146 -0.411055 -0.771329  0.110477
E  0.97572 -0.388239  0.783316 -0.708954

In [74]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [76]:
resultdf = df[df['Z']<0]

In [77]:
resultdf

         W         X         Y         Z
A  1.60678 -1.115710 -1.385379 -1.329660
E  0.97572 -0.388239  0.783316 -0.708954

In [78]:
resultdf['X']

A   -1.115710
E   -0.388239
Name: X, dtype: float64

In [80]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [79]:
df[df['W']>0]['X']

A   -1.115710
B   -0.411055
E   -0.388239
Name: X, dtype: float64

In [81]:
df[df['W']>0][['Y','X']]

          Y         X
A -1.385379 -1.115710
B -0.771329 -0.411055
E  0.783316 -0.388239

In [84]:
boolser = df['W']>0
result = df[boolser]

In [85]:
result

         W         X         Y         Z
A  1.60678 -1.115710 -1.385379 -1.329660
B  0.04146 -0.411055 -0.771329  0.110477
E  0.97572 -0.388239  0.783316 -0.708954

In [86]:
mycols = ['Y','X']
result[mycols]

          Y         X
A -1.385379 -1.115710
B -0.771329 -0.411055
E  0.783316 -0.388239

In [87]:
df[df['W']>0]

         W         X         Y         Z
A  1.60678 -1.115710 -1.385379 -1.329660
B  0.04146 -0.411055 -0.771329  0.110477
E  0.97572 -0.388239  0.783316 -0.708954

In [88]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [89]:
df[(df['W']>0) & (df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [90]:
df[(df['W']>0) & (df['Y']>0)]

         W         X         Y         Z
E  0.97572 -0.388239  0.783316 -0.708954

In [93]:
df[(df['W']>1) | (df['Y']>1)]

         W        X         Y        Z
A  1.60678 -1.11571 -1.385379 -1.32966

In [94]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [95]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.606780 -1.115710 -1.385379 -1.329660
1     B  0.041460 -0.411055 -0.771329  0.110477
2     C -0.804652  0.253548  0.649148  0.358941
3     D -1.080471  0.902398  0.161781  0.833029
4     E  0.975720 -0.388239  0.783316 -0.708954

In [96]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [97]:
newind = 'CA NY WY OR CO'.split()

In [98]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [99]:
df['States'] = newind

In [100]:
df

          W         X         Y         Z States
A  1.606780 -1.115710 -1.385379 -1.329660     CA
B  0.041460 -0.411055 -0.771329  0.110477     NY
C -0.804652  0.253548  0.649148  0.358941     WY
D -1.080471  0.902398  0.161781  0.833029     OR
E  0.975720 -0.388239  0.783316 -0.708954     CO

In [101]:
df.set_index('States')

               W         X         Y         Z
States
CA      1.606780 -1.115710 -1.385379 -1.329660
NY      0.041460 -0.411055 -0.771329  0.110477
WY     -0.804652  0.253548  0.649148  0.358941
OR     -1.080471  0.902398  0.161781  0.833029
CO      0.975720 -0.388239  0.783316 -0.708954

In [102]:
df

          W         X         Y         Z States
A  1.606780 -1.115710 -1.385379 -1.329660     CA
B  0.041460 -0.411055 -0.771329  0.110477     NY
C -0.804652  0.253548  0.649148  0.358941     WY
D -1.080471  0.902398  0.161781  0.833029     OR
E  0.975720 -0.388239  0.783316 -0.708954     CO

In [103]:
# Index levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [108]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [109]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [110]:
df

             A         B
G1 1  0.586847 -1.621348
   2  0.677535  0.026105
   3 -1.678284  0.333973
G2 1 -0.532471  2.117727
   2  0.197524  2.302987
   3  0.729024 -0.863091

In [111]:
df.loc['G1']

          A         B
1  0.586847 -1.621348
2  0.677535  0.026105
3 -1.678284  0.333973

In [112]:
df.loc['G1'].loc[1]

A    0.586847
B   -1.621348
Name: 1, dtype: float64

In [114]:
df.index.names = ['Goups', 'Nums']

In [115]:
df

                   A         B
Goups Nums
G1    1     0.586847 -1.621348
      2     0.677535  0.026105
      3    -1.678284  0.333973
G2    1    -0.532471  2.117727
      2     0.197524  2.302987
      3     0.729024 -0.863091

In [116]:
df.loc['G2'].loc[2]['B']

2.3029872653509056

In [117]:
df

                   A         B
Goups Nums
G1    1     0.586847 -1.621348
      2     0.677535  0.026105
      3    -1.678284  0.333973
G2    1    -0.532471  2.117727
      2     0.197524  2.302987
      3     0.729024 -0.863091

In [118]:
df.xs('G1')

             A         B
Nums
1     0.586847 -1.621348
2     0.677535  0.026105
3    -1.678284  0.333973

In [121]:
df.xs(1,level='Nums')

              A         B
Goups
G1     0.586847 -1.621348
G2    -0.532471  2.117727